scripts/load-test/results/20260827T165958Z-smoke_health_.txt
Running 30s test @ http://rmone-pilot2-193501891377.us-east-1.elasticbeanstalk.com/health
25 connections


┌─────────┬────────┬────────┬────────┬────────┬───────────┬──────────┬────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev    │ Max    │
├─────────┼────────┼────────┼────────┼────────┼───────────┼──────────┼────────┤
│ Latency │ 214 ms │ 217 ms │ 227 ms │ 236 ms │ 219.72 ms │ 20.14 ms │ 467 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴──────────┴────────┘
┌───────────┬───────┬───────┬─────────┬─────────┬─────────┬─────────┬───────┐
│ Stat      │ 1%    │ 2.5%  │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min   │
├───────────┼───────┼───────┼─────────┼─────────┼─────────┼─────────┼───────┤
│ Req/Sec   │ 75    │ 75    │ 115     │ 123     │ 113.17  │ 8.83    │ 75    │
├───────────┼───────┼───────┼─────────┼─────────┼─────────┼─────────┼───────┤
│ Bytes/Sec │ 23 kB │ 23 kB │ 35.3 kB │ 37.8 kB │ 34.7 kB │ 2.71 kB │ 23 kB │
└───────────┴───────┴───────┴─────────┴─────────┴─────────┴─────────┴───────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 3395  │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 30

3k requests in 30.03s, 1.04 MB read